app/views/products/index.html.erb

                      <p class="text-small">
                      <%if product.reviews.present? %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 327